/*
 * ------------------------------------------------------------
 * IMPORTANT: The contents of this file are auto-generated.
 *
 * This file may be updated by the Shopify admin theme editor
 * or related systems. Please exercise caution as any changes
 * made to this file may be overwritten.
 * ------------------------------------------------------------
 */
{
  "sections": {
    "1656355670207a3faa": {
      "type": "old-one_rep_max_calculator",
      "settings": {
        "header_image": "shopify://shop_images/image_7_1.png",
        "title": "1 Rep-Max Calculator",
        "detail": "Curious how strong you are? This 1-rep max calculator, which is the perfect bench press calculator, squat calculator, or deadlift calculator, will instantly project your 1-rep maximum (1RM) for any lift based on how many repetitions you can complete in one set with a submaximal weight. For example, if you can do one set of 10 reps with 135 pounds on the bench press, enter 135 lbs as the “weight lifted” and 10 as the “reps completed” to calculate your 1-rep max.",
        "resources_heading": "Why Use a 1-Rep Max Calculator?",
        "resources_detail": "<p>This 1-rep max (1RM) calculator is an essential tool for projecting how much weight you can lift for one clean repetition on any exercise. Powerlifters and strength athletes will often use a 1-rep max calculator before competitions and training sessions as it gives them a sense of how heavy to go on certain lifts. </p><p>Even for everyday gym-goers, a 1-rep max calculator comes in handy for gauging progress. </p><p><strong>Is a 1-Rep Max Calculator Always Right?</strong></p><p>Given the nuances of athletic performance and testing your 1-rep max, it's entirely possible for your true 1RM to be greater or lesser than the estimation provided by a 1RM calculator. </p><p>Intuitively, you'll need to use good judgement during your workout to determine how much weight you feel confident in lifting. </p><p><strong>Most Accurate Way to Calculate 1-Rep Max on the Bench, Squat, and Deadlift</strong></p><p>For accuracy when using a 1-rep max calculator, especially when projecting your 1RM on the bench, squat, and deadlift, we recommend entering your current 3-to-5 rep maximums. As the number of reps increase (and the load decreases), the less reliable the projected 1-rep max becomes. Hence, our 1-rep max calculator doesn't go beyond 12 repetitions for estimating your 1RM.</p><p><strong>How to Test Your 1-Rep Max</strong></p><p>Properly warming up for your 1-rep max is imperative. After you've used our 1-rep max calculator to project the load you can lift, use the 2-rep max through 12-rep max lifts as guidelines for warming up. </p><p>Importantly, don't overdo it on your warm-up sets. Keep the repetitions betweem 1-3 per set and focus on moving the bar explosively (especially during the lighter sets). The goal is simply to prepare your neuromuscular system and get some blood flowing; you should not feel exhausted or sore by the time you've worked up to your projected 1-RM.</p><p><strong>The Importance of Preparation for Max Strength Performance</strong></p><p>It's wise to take several full rest days leading up to the training session/competition in which you plan on pushing for a new 1-rep max. Doing this will ensure your muscles and nervous system have had time to recover. </p><p>On the day of testing your 1RM, eat a solid <a href=\"/blogs/all/pre-workout-nutrition-how-to-fuel-your-body\" title=\"Evidence-Based Pre-Workout Nutrition: What's the Optimal Fuel for Your Body?\">pre-workout meal</a> about 1-2 hours before your training session/competition. If you want a little extra \"pep,\" supplement with <a href=\"/products/preseries-bulk-preworkout\" title=\"PreSeries BULK Pre-Workout\">Transparent Labs BULK pre-workout</a> about 30 minutes prior to lifting.  </p><p>Remember, lifting is as much a pyschological challenge as it is a physical one. Envision yourself lifting your target 1-rep max before you even get to the gym. Keep reminding yourself how hard you've worked to get to this point and how good it will feel to break your previous limits. </p><p>And don't be afraid to use your resources to psyche yourself up! Put on your favorite workout playlist, inhale some ammonia salts, and slap yourself in the face if that's what it takes to get your mind right!</p><p><strong>Can Supplements Increase Your 1-Rep Max?</strong></p><p>There are a select few supplements that can help you lift more weight. Notably, creatine monohydrate, the main ingredient in <a href=\"/products/strengthseries-creapure-hmb-creatine-supplement\" title=\"StrengthSeries Creatine HMB\">Transparent Labs Creatine HMB</a>, stands atop the short list of sports supplements that have been shown to enhance strength and power [1, 2]. Other options include the likes of caffeine and ingredients in <a href=\"/products/strengthseries-build\" title=\"StrengthSeries Build\">Transparent Labs BUILD</a> [3-6].</p><p><strong>Further Strength-Training Resources</strong></p><p>Even with the perfect workout routine, improving your 1-rep max will take time, dedication, and consistency in and out of the gym. If you’re new to strength training, we highly recommend reading our <a href=\"https://www.transparentlabs.com/blogs/all/push-pull-legs-routine-guide-to-ppl\"><span style=\"text-decoration:underline\">Guide to the Push-Pull-Legs Routine</span></a>.</p><p>More advanced lifters should check out this <a href=\"https://www.transparentlabs.com/blogs/all/powerbuilding-program-for-strength-and-size\"><span style=\"text-decoration:underline\">Powerbuilding Guide</span></a>. </p><p>No matter what training program you follow, focus on <a href=\"https://www.transparentlabs.com/blogs/all/progressive-overload-explained-how-to-train-for-strength-and-size\"><span style=\"text-decoration:underline\">progressive overload</span></a> and continually challenge yourself in the gym. Your muscles have no reason to get stronger if you don’t push yourself. </p><p>And of course, don’t overlook the importance of nutrition for increasing your 1-rep max. You need to consume plenty of protein to facilitate muscle recovery and growth, both of which are essential to building strength over time.  </p><p>Here are some helpful resources to help you master the basics of muscle-building nutrition: </p><p>→ <a href=\"https://www.transparentlabs.com/blogs/all/how-much-protein-should-i-eat\"><span style=\"text-decoration:underline\">How Much Protein Should You Eat?</span></a></p><p>→ <a href=\"https://www.transparentlabs.com/blogs/all/pre-workout-nutrition-how-to-fuel-your-body\"><span style=\"text-decoration:underline\">Evidence-Based Pre-Workout Nutrition</span></a></p><p>→ <a href=\"https://www.transparentlabs.com/blogs/all/powerlifting-diet-performance-nutrition-strength-athlete\"><span style=\"text-decoration:underline\">Powerlifting Diet 101</span></a></p>",
        "references_heading": "References",
        "references_detail": "<p>1. Lanhers, C., Pereira, B., Naughton, G., Trousselard, M., Lesage, F. X., & Dutheil, F. (2017). <a href=\"https://pubmed.ncbi.nlm.nih.gov/27328852/\"><span style=\"text-decoration:underline\">Creatine Supplementation and Upper Limb Strength Performance: A Systematic Review and Meta-Analysis</span></a>. <em>Sports medicine (Auckland, N.Z.)</em>, <em>47</em>(1), 163–173.</p><p>2. Lanhers, C., Pereira, B., Naughton, G., Trousselard, M., Lesage, F. X., & Dutheil, F. (2015). <a href=\"https://pubmed.ncbi.nlm.nih.gov/25946994/\"><span style=\"text-decoration:underline\">Creatine Supplementation and Lower Limb Strength Performance: A Systematic Review and Meta-Analyses</span></a>. <em>Sports medicine (Auckland, N.Z.)</em>, <em>45</em>(9), 1285–1294.</p><p>3. Joy, J. M., Vogel, R. M., Moon, J. R., Falcone, P. H., Mosman, M. M., Pietrzkowski, Z., Reyes, T., & Kim, M. P. (2016). <a href=\"https://pubmed.ncbi.nlm.nih.gov/27430755/\"><span style=\"text-decoration:underline\">Ancient peat and apple extracts supplementation may improve strength and power adaptations in resistance-trained men</span></a>. <em>BMC complementary and alternative medicine</em>, <em>16</em>, 224.</p><p>4. Lang, C. H., Pruznak, A., Navaratnarajah, M., Rankine, K. A., Deiter, G., Magne, H., Offord, E. A., & Breuillé, D. (2013). <a href=\"https://pubmed.ncbi.nlm.nih.gov/23757407/\"><span style=\"text-decoration:underline\">Chronic α-hydroxyisocaproic acid treatment improves muscle recovery after immobilization-induced atrophy</span></a>. <em>American journal of physiology. Endocrinology and metabolism</em>, <em>305</em>(3), E416–E428.</p><p>5. Hirsch, K. R., Smith-Ryan, A. E., Roelofs, E. J., Trexler, E. T., & Mock, M. G. (2017). <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5236007/\"><span style=\"text-decoration:underline\">Cordyceps militaris Improves Tolerance to High-Intensity Exercise After Acute and Chronic Supplementation</span></a>. <em>Journal of dietary supplements</em>, <em>14</em>(1), 42–53.</p><p>6. Grgic, J., Mikulic, P., Schoenfeld, B. J., Bishop, D. J., & Pedisic, Z. (2019). <a href=\"https://pubmed.ncbi.nlm.nih.gov/30298476/\" target=\"_blank\" title=\"https://pubmed.ncbi.nlm.nih.gov/30298476/\">The Influence of Caffeine Supplementation on Resistance Exercise: A Review</a>. <em>Sports medicine (Auckland, N.Z.)</em>, <em>49</em>(1), 17–30. </p>"
      }
    },
    "shogun-helper": {
      "type": "shogun-helper",
      "settings": {}
    },
    "shogun-optimizer": {
      "type": "shogun-optimizer",
      "settings": {}
    }
  },
  "order": [
    "shogun-helper",
    "1656355670207a3faa",
    "shogun-optimizer"
  ]
}
