/*
 * ------------------------------------------------------------
 * IMPORTANT: The contents of this file are auto-generated.
 *
 * This file may be updated by the Shopify admin theme editor
 * or related systems. Please exercise caution as any changes
 * made to this file may be overwritten.
 * ------------------------------------------------------------
 */
{
  "sections": {
    "main": {
      "type": "old-TL_body_fat_calculator",
      "settings": {
        "header_image": "shopify://shop_images/image_7.png",
        "title": "Body Fat Calculator",
        "detail": "This body fat calculator uses your waist, hips (females only), and neck measurements in conjunction with body weight, height, and biological sex to estimate body fat percentage and total fat mass. If you don’t know your waist/hip/neck measurements, please scroll down for instructions on how to measure them.",
        "resources_heading": "How to Use This Body Fat Calculator",
        "resources_detail": "<p>After you've weighed yourself (ideally on an empty stomach), you will need a tape measure to assess the circumference of your waist, hips, and neck. Once measuring is complete, enter your respective results (in inches or centimeters) in the body fat calculator above to estimate your body fat percentage.</p><p><strong>Neck (Males and Females): </strong>Extend the tape measure horizontally all the way around your neck so it’s directly on the skin just below the larynx (i.e. Adam’s apple). Keep your shoulders relaxed and head neutral for accuracy.</p><p><strong>Waist (Males): </strong>Place the tape measure over your belly button and extend horizontally all the way around, again ensuring direct contact with the skin. Record the measurement on exhale. </p><p><strong>Waist (Females): </strong>Measure horizontally all the way around your “natural waist,” typically located halfway between the belly button and sternum (breastbone). The measurement should be taken on exhale.</p><p><strong>Hips (Females Only): </strong>The hip measurement is taken by passing horizontally over the fullest part of the buttocks to the anterior (front) side of the pelvis. </p><p><strong>DEXA Scan vs. Online Body Fat Calculator</strong></p><p>This body fat calculator is meant to give you a ballpark estimate of your body fat percentage by using the United States Navy's longstanding mathematical model to predict body fat [<a href=\"https://pubmed.ncbi.nlm.nih.gov/25562863/\" target=\"_blank\" title=\"https://pubmed.ncbi.nlm.nih.gov/25562863/\">1</a>]. While an online body fat calculator is practical, it may not be as accurate as other body fat measurements, notably dual-energy X-ray absorptiometry (DEXA) scans and hydrostatic weighing. </p><p>Despite being less precise than DEXA scans, an online body fat calculator is much simpler and more accessible; DEXA scans can be costly and hard to find. </p><p>Regardless, DEXA scans are widely touted as the \"gold standard\" for testing body composition and body fat percentage [<a href=\"https://pubmed.ncbi.nlm.nih.gov/24735332/\" target=\"_blank\" title=\"https://pubmed.ncbi.nlm.nih.gov/24735332/\">2</a>]; these scans use a two energetically distinct laser beams that assess the amount of X-ray absorption by bone tissue.</p><p>You can read more about DEXA scans and body composition in the articles below:</p><p>→ <a href=\"https://www.transparentlabs.com/blogs/all/what-is-body-composition-how-to-calculate-body-fat-percentage\"><span style=\"text-decoration:underline\">What Is Body Composition</span></a></p><p><strong>BMI Calculator vs. Body Fat Calculator</strong></p><p>Your body weight and height are all that go into determing your body mass index (BMI); hence, a BMI calculator tells you nothing about body composition. On the contrary, a body fat calculator gives you insight into your proportions of lean body mass and fat tissue, which are important qualitative metrics for health and fitness.</p><p>Body mass index, in and of itself, can be very misleading. For example, people who are very muscular may be classified as \"obese\" by BMI standards simply because it uses your weight, height, age, and biological sex to determine if you're in a healthy weight range or not. </p><p>As such, body composition and body fat percentage are typically better measures of progress for fitness purposes. Quality matters when it comes to being lean. It doesn't matter how heavy you are -- if you're carrying 30% of that weight as body fat, you won't be able to see much of the muscle you packed on over the years.</p><p>By the same token, there are plenty of bodybuilders and athletes who only weigh 170 pounds at 5'10\" (or taller), yet they look very muscular because of how lean they are. As they say, it's all about creating an illusion.</p><p>Whether your goal is to lose weight or pack on muscle mass, improving body composition takes time and commitment to your diet and workout routine. If you’re not sure where to start, try out our handy <a href=\"https://www.transparentlabs.com/blogs/all/body-recomposition-how-to-lose-fat-and-gain-muscle\"><span style=\"text-decoration:underline\">8-week Body Recomposition Program</span></a>! </p><p>And if losing belly fat is a priority, give the following article a quick scan to avoid a common mistake: <a href=\"https://www.transparentlabs.com/blogs/all/how-to-get-rid-of-belly-fat\" title=\"https://www.transparentlabs.com/blogs/all/how-to-get-rid-of-belly-fat\"><span style=\"text-decoration:underline\">How to Get Rid of Belly Fat</span></a></p>",
        "references_heading": "References",
        "references_detail": "<p>1. Peterson D. D. (2015). <a href=\"https://pubmed.ncbi.nlm.nih.gov/25562863/\" target=\"_blank\" title=\"https://pubmed.ncbi.nlm.nih.gov/25562863/\">History of the U.S. Navy Body Composition program</a>. <em>Military medicine</em>, <em>180</em>(1), 91–96. </p><p>2. Fosbøl, M. Ø., & Zerahn, B. (2015). <a href=\"https://pubmed.ncbi.nlm.nih.gov/24735332/\" target=\"_blank\" title=\"https://pubmed.ncbi.nlm.nih.gov/24735332/\">Contemporary methods of body composition measurement</a>. <em>Clinical physiology and functional imaging</em>, <em>35</em>(2), 81–97. </p>"
      }
    }
  },
  "order": [
    "main"
  ]
}
